import json

from django.http import HttpResponse


def patent_pie(request):
    if request.method == 'GET':
        res = {
            "num_patent_types": [84, 901, 52],
            "num_applicants_types": [262, 546, 134, 55, 40],
        }
        res = json.dumps(res)
        return HttpResponse(res)


def patent_line_race(request):
    if request.method == 'GET':
        res = {
            "time_x_label": [
                "2020.01",
                "2020.02",
                "2020.03",
                "2020.04",
                "2020.05",
                "2020.06",
                "2020.07",
                "2020.08",
                "2020.09",
                "2020.10",
                "2020.11",
                "2020.12",
            ],
            "sum": [
                {
                    "name": "乌鲁木齐",
                    "data": [
                        1000, 1100, 1400, 1400, 2000, 2400, 3000, 3000, 4000, 4766,
                        5315, 5332,
                    ],
                },
                {
                    "name": "昌吉州",
                    "data": [
                        100, 110, 140, 170, 200, 240, 300, 350, 400, 476, 531, 533,
                    ],
                },
                {
                    "name": "克拉玛依",
                    "data": [
                        55, 102, 138, 188, 246, 313, 386, 413, 457, 473, 556, 646,
                    ],
                },
                {
                    "name": "石河子",
                    "data": [
                        20, 109, 114, 192, 208, 271, 307, 339, 350, 399, 498, 523,
                    ],
                },
                {
                    "name": "伊犁州",
                    "data": [
                        35, 95, 141, 229, 261, 354, 396, 396, 403, 481, 518, 558,
                    ],
                },
                {
                    "name": "博州",
                    "data": [
                        69, 96, 116, 210, 280, 301, 360, 397, 413, 489, 570, 639,
                    ],
                },
                {
                    "name": "塔城",
                    "data": [
                        69, 96, 116, 210, 280, 301, 360, 397, 413, 489, 570, 639,
                    ],
                },
                {
                    "name": "阿勒泰",
                    "data": [25, 65, 82, 121, 129, 155, 159, 168, 195, 209, 209, 226],
                },
                {
                    "name": "吐鲁番",
                    "data": [
                        69, 96, 116, 210, 280, 301, 360, 397, 413, 489, 570, 639,
                    ],
                },
                {
                    "name": "哈密",
                    "data": [1, 19, 21, 35, 52, 59, 67, 84, 86, 100, 117, 136],
                },
                {
                    "name": "巴州",
                    "data": [1, 19, 21, 35, 52, 59, 67, 84, 86, 100, 117, 136],
                },
                {
                    "name": "阿克苏",
                    "data": [25, 65, 82, 121, 129, 155, 159, 168, 195, 209, 209, 226],
                },
                {
                    "name": "喀什",
                    "data": [
                        69, 96, 116, 210, 280, 301, 360, 397, 413, 489, 570, 639,
                    ],
                },
                {
                    "name": "和田",
                    "data": [1, 19, 21, 35, 52, 59, 67, 84, 86, 100, 117, 136],
                },
                {
                    "name": "克州",
                    "data": [1, 19, 21, 35, 52, 59, 67, 84, 86, 100, 117, 136],
                },
            ],
        }
        res = json.dumps(res)
        return HttpResponse(res)


def patent_line(request):
    if request.method == 'GET':
        res = {
            "dataset": {
                "source": [
                    [
                        "Proportion",
                        "2020.10",
                        "2020.11",
                        "2020.12",
                        "2021.01",
                        "2021.02",
                        "2021.03",
                    ],
                    ["发明专利", 326, 468, 92, 59, 84, 102],
                    ["实用新型", 1390, 1670, 1077, 865, 901, 1196],
                    ["外观设计", 91, 91, 79, 50, 52, 133],
                ],
            },
        }
        res = json.dumps(res)
        return HttpResponse(res)


def patent_map(request):
    if request.method == "GET":
        res = {
            "num": [
                {"name": "乌鲁木齐", "value": 507},
                {"name": "昌吉州", "value": 61},
                {"name": "克拉玛依", "value": 44},
                {"name": "石河子", "value": 70},
                {"name": "伊犁州", "value": 65},
                {"name": "博州", "value": 16},
                {"name": "塔城", "value": 30},
                {"name": "阿勒泰", "value": 14},
                {"name": "吐鲁番", "value": 32},
                {"name": "哈密", "value": 71},
                {"name": "巴州", "value": 47},
                {"name": "阿克苏", "value": 62},
                {"name": "喀什", "value": 36},
                {"name": "和田", "value": 9},
                {"name": "克州", "value": 4},
            ],
        }
        res = json.dumps(res)
        return HttpResponse(res)
